{
  "titre": "Device Fingerprinting",
  "introduction": {
    "texte": {
      "intro": "<section class=\"intro-container\" style=\"text-align:left;\">\n  <h2 class=\"intro-title\">Qu’est-ce que le device fingerprinting ?</h2>\n  <p>\n    Le device fingerprinting (ou empreinte numérique d’un appareil) est une méthode de traçage permettant d’identifier un utilisateur en ligne sans cookies. \n    Elle repose sur la collecte de nombreux paramètres techniques comme :\n  </p>\n  <ul>\n    <li>le navigateur utilisé,</li>\n    <li>la résolution d’écran,</li>\n    <li>les polices installées,</li>\n    <li>la carte graphique,</li>\n    <li>ou encore le fuseau horaire.</li>\n  </ul>\n  <p>\n    Ces données, combinées, forment une signature unique pour chaque appareil.\n  </p>\n\n  <hr />\n\n  <h3>Un traçage difficile à bloquer</h3>\n  <ul>\n    <li>Le fingerprinting ne peut pas être supprimé par l’utilisateur.</li>\n    <li>Il est souvent invisible et échappe au consentement explicite.</li>\n    <li>Il fonctionne même avec un VPN ou un changement de navigateur.</li>\n  </ul>\n  <p>\n    Cela en fait un outil puissant mais intrusif.\n  </p>\n\n  <hr />\n\n  <h3>À quoi sert-il ?</h3>\n  <p>Le fingerprinting est utilisé dans de nombreux contextes :</p>\n  <ul>\n    <li>Ciblage publicitaire</li>\n    <li>Lutte contre la fraude</li>\n    <li>Détection de bots</li>\n    <li>Personnalisation de contenu</li>\n  </ul>\n  <p>Mais il est aussi critiqué pour ses impacts sur la vie privée.</p>\n\n  <hr />\n\n  <h3>Des usages étendus</h3>\n  <p>Le fingerprinting dépasse aujourd’hui le simple navigateur :</p>\n  <ul>\n    <li>Il s’étend aux objets connectés (IoT),</li>\n    <li>aux signatures radio (RF/UWB),</li>\n    <li>et aux environnements virtualisés via des techniques comme WebAssembly.</li>\n  </ul>\n\n  <hr />\n\n  <h3>Des moyens de défense existent</h3>\n  <p>Face à ces menaces, des solutions émergent :</p>\n  <ul>\n    <li>Navigateurs axés sur la vie privée (Brave, Firefox, Psylo)</li>\n    <li>Randomisation des paramètres matériels</li>\n    <li>Brouillage radio ciblé (friendly jamming)</li>\n    <li>Extensions anti-fingerprinting</li>\n  </ul>\n\n  <hr />\n\n  <h3>Ce que vous allez découvrir</h3>\n  <p>La sélection d’articles ci-dessous explore :</p>\n  <ul>\n    <li>les avancées technologiques du fingerprinting,</li>\n    <li>ses implications légales (RGPD, CNIL, etc.),</li>\n    <li>et les contre-mesures possibles.</li>\n  </ul>\n</section>"
    }
  },
  "image": {
    "url": "https://actusdigital.com/wp-content/uploads/2021/06/Adwatch-min.jpeg",
    "alt": "Illustration d'une empreinte digitale, symbolisant le fingerprinting numérique"
  },
  "articles": [
    {
      "titre": "VPNs cannot protect against browser fingerprinting – but this new web browser could be the fix",
      "date": "2025-06-21",
      "resume": "Psylo, un navigateur mobile conçu par les chercheurs Talal Haj Bakry et Tommy Mysk, vise à combattre le fingerprinting mieux qu’un VPN. Il utilise un système d’« onglets silo » isolés, chacun avec son propre stockage, cookies, adresse IP via plus de 40 proxy mondiaux, fuseau horaire et langue distincts. Psylo applique aussi des techniques anti-fingerprinting comme la randomisation du canvas et des caractéristiques « fuzzy ». Il ne nécessite pas de compte, suit une stricte politique no‑log, et propose un essai gratuit de 3 jours depuis sa sortie le 17 juin 2025. Disponible sur iOS/iPadOS (et potentiellement Android selon l’adoption), Psylo offre une protection avancée pour ceux qui veulent échapper au tracking numérique que les VPN ne bloquent pas",
      "points": ["Psylo", "onglets silo", "proxy global", "canvas randomisation", "no‑log"],
      "lien": "https://www.techradar.com/vpn/vpn-privacy-security/vpns-cannot-protect-against-browser-fingerprinting-but-this-new-web-browser-could-be-the-fix"
    },
    {
      "titre": "Google Autorise le Fingerprinting : La Fin de la Vie Privée ?",
      "date": "2025-02-18",
      "resume": "Google a mis à jour sa politique publicitaire en février 2025, autorisant les annonceurs à recourir au fingerprinting, une technique de suivi basée sur des paramètres matériels et logiciels. Contrairement aux cookies, ce suivi est difficile à détecter ou bloquer. Cette décision inquiète les régulateurs (CNIL, ICO) et des ONG comme l’EFF, qui craignent un profilage intensif des utilisateurs. Le fingerprinting pourrait s’étendre aux objets connectés et ne nécessite aucun consentement explicite. Des navigateurs alternatifs comme Brave ou Firefox sont recommandés pour limiter l’exposition.",
      "points": ["Google", "suivi publicitaire", "EFF", "CNIL", "cookies vs fingerprinting"],
      "lien": "https://innovations.fr/google-autorise-le-fingerprinting-la-fin-de-la-vie-privee/"
    },
    {
      "titre": "Browser Fingerprinting Using WebAssembly",
      "date": "2025-05-31",
      "resume": "Des chercheurs ont démontré que WebAssembly permet un fingerprinting plus précis des navigateurs et appareils que JavaScript seul. En exploitant les temps d'exécution des instructions Wasm et les API bas niveau, ils identifient de subtiles différences entre plateformes. Le modèle fonctionne sur diverses architectures (Intel, AMD, ARM) et environnements (VM, mobiles). Le taux de faux positifs est inférieur à 1 %, même dans des systèmes virtualisés. L’étude propose aussi des pistes de mitigation pour les navigateurs.",
      "points": ["WebAssembly", "timing attacks", "API bas niveau", "virtualisation", "mitigation"],
      "lien": "https://arxiv.org/abs/2506.00719"
    },
    {
      "titre": "Tracking UWB Devices Through Radio Frequency Fingerprinting Is Possible",
      "date": "2025-01-08",
      "resume": "Cette étude montre qu'il est possible de suivre des dispositifs UWB à l’aide de leur empreinte radio. Un modèle de deep learning a été entraîné à identifier des appareils commerciaux selon leur signature RF. Les résultats atteignent 99 % de précision dans des contextes connus et restent performants dans des environnements inconnus. Cela soulève des préoccupations de confidentialité physique concernant les appareils connectés utilisant l’UWB.",
      "points": ["UWB", "radio fingerprinting", "deep learning", "traçabilité", "signature matérielle"],
      "lien": "https://arxiv.org/abs/2501.04401"
    },
    {
      "titre": "Fingerprinting and Tracing Shadows: The Development and Impact of Browser Fingerprinting on Digital Privacy",
      "date": "2024-11-18",
      "resume": "Ce document académique retrace l’évolution du fingerprinting navigateur, ses techniques et son impact sur la vie privée. Il analyse les éléments collectés (Canvas, WebGL, entêtes HTTP…), leur unicité (entropie) et les risques légaux (RGPD). L’article recommande des contre-mesures comme l’usage de navigateurs respectueux de la vie privée, des extensions et l’obfuscation des caractéristiques techniques.",
      "points": ["Canvas/WebGL", "entropie", "RGPD", "extensions", "protection vie privée"],
      "lien": "https://arxiv.org/abs/2411.12045"
    },
    {
      "titre": "The First Early Evidence of the Use of Browser Fingerprinting for Online Tracking",
      "date": "2024-09-24",
      "resume": "Ce papier présente FPTrace, un outil d’évaluation du fingerprinting publicitaire. En simulant différents fingerprintings, les auteurs démontrent que des changements de profil influencent directement les enchères publicitaires et prouvent l’usage effectif du fingerprinting pour le ciblage. Cette utilisation viole potentiellement les réglementations comme le RGPD, car elle contourne le consentement de l’utilisateur.",
      "points": ["FPTrace", "ciblage pub", "enchères temps réel", "RGPD", "consentement contourné"],
      "lien": "https://arxiv.org/abs/2409.15656"
    },
    {
      "titre": "Preventing Radio Fingerprinting through Friendly Jamming",
      "date": "2024-07-15",
      "resume": "Les chercheurs proposent une méthode de protection contre le fingerprinting radio via un brouillage ciblé (friendly jamming). Ce système empêche la lecture de l’empreinte RF d’un appareil sans nuire à sa capacité de communication. Les résultats expérimentaux indiquent une réduction drastique de l’identifiabilité, tout en préservant la qualité de service pour l’utilisateur légitime.",
      "points": ["radio fingerprinting", "friendly jamming", "brouillage ciblé", "qualité de service", "anonymisation"],
      "lien": "https://arxiv.org/abs/2407.08311"
    }
  ]
}
